org/Documentos/notes/org/data_docs.tex
% Created 2025-04-16 qua 14:30
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Lucas Cunegundes}
\date{\today}
\title{data\textsubscript{docs}}
\hypersetup{
 pdfauthor={Lucas Cunegundes},
 pdftitle={data\textsubscript{docs}},
 pdfkeywords={},
 pdfsubject={Retenção de Dados, Data Archiving e Liberação de Dados em Disco},
 pdfcreator={Emacs 29.3 (Org mode 9.7.27)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Retenção de Dados}
\label{sec:org7a7a77c}

Melhora o desempenho, escalabilidade, reduz custo e minimiza riscos de segurança
Armazenar os dados por um tempo específico

\begin{itemize}
\item Identificação dos Dados
\item Métodos de Armazenamento
\item Formato dos Dados
\item Períodos de Retenção
\item Procedimentos de Descarte
\item Arquivamento e Backup
\item Funções e Responsabilidades
\end{itemize}
\subsection{GDPR}
\label{sec:org59fd872}

Dados devem ser mantidos de uma forma que permita a identificação dos titulares
desses dados somente pelo período necessário para a finalidade dos dados
\section{Data Archiving}
\label{sec:orgfc72a57}

Mover dados para áreas seguras e fora da infraestrutura principal
É diferente de um Backup, pois archiving cumpre a finalidade de reter dados e backup é uma cópia de segurança
para proteger e recuperar de desastres
\subsection{Data Archiving X Backup}
\label{sec:org205db19}

Data Archiving cumpre a finalidade de reter dados, os arquivos armazenados devem ser tratados
como parte de um repositório de dados

Backups, por outro lado, fazem parte de um mecanismo voltado para recuperação de dados do sistema
primário de armazenamento
\subsection{Técnicas Comuns}
\label{sec:orga7560ef}

\subsubsection{Tabela de Histórico}
\label{sec:org226d850}
Mover dados antigos da tabela principal para uma tabela \texttt{*\_history} ou \texttt{*\_archive}

\begin{verbatim}
INSERT INTO tabela_historico
SELECT * FROM tabela1 WHERE tabela1.data < CURRENT_DATE - INTERVAL '2 years';
DELETE FROM tabela1 WHERE tabela1.data < CURRENT_DATE - INTERVAL '2 years';
\end{verbatim}
\subsubsection{Particionamento por Tempo}
\label{sec:orgaa770dd}
Permite dividir dados por mês / ano e truncar partições antigas rapidamente

\begin{verbatim}
CREATE TABLE tabela (
       id SERIAL,
       data DATE,
       valor NUMERIC
) PARTITION BY RANGE (tabela.data);
\end{verbatim}
\subsubsection{Cold Storage / Data Lakes}
\label{sec:org1947609}
Exportar dados inativos em CSV / Parquet para buckets em nuvem (S3, Azure Blob). Ferramentas
como Apache NiFi, Airflow ou Glue são comuns aqui
\subsubsection{Comprenssão e indexação espacial}
\label{sec:org764a562}
Dados arquivados podem usar comprenssão agressiva (ex: ZSTD, LZMA), menos índices e armazenamento
mais barato
\section{Liberação de Espaço em Disco}
\label{sec:org5374c85}

Jobs agendados com cron, como por exemplo:
\begin{itemize}
\item Jobs noturnos para arquivar dados
\item Jobs semanais para apagar sessões antigas ou logs
\item Jobs mensais para compactar dados arquivados
\end{itemize}

Políticas de ciclo de vida em storage (cloud)
\begin{itemize}
\item AWS S3: regra de expiração de objeto após \texttt{x} dias
\item Azure: Arquivamento automático de dados inativos
\end{itemize}
\subsection{PostgreSQL}
\label{sec:org1c45d59}

Manutenções periódicas conhecidas como \texttt{vacuuming}. Na maioria dos caso, é suficiente
deixar que o \texttt{autovacuum} daemon tome conta disso. Alguns administradores de banco de dados
poderão querer suplementar or substituir as atividades desse daemon com comandos manuais \texttt{VACUUM}
o que tipicamente são executados de acordo com um agendamento pelo \texttt{chron} ou outros scripts

\texttt{VACUUM FULL} no máximo aproximadamente 30 minutos na janela de 14h40 às 15h10, considerar também janelas
de sincronização dos bancos de dados dos raspberries com o banco de dados da aplicação

A utilização recomendada do \texttt{VACUUM} para quem não preferir desativar o daemon \texttt{autovacuum}, é de uma vez por dia durante
os períodos de baixo uso do banco, complementados com limpezas mais frequentes nas tabelas mais utilizadas conforme necessário
\subsubsection{Vacuuming}
\label{sec:orgdaa3ee1}
\end{document}
